<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Пути к библиотекам работы с файлами
    |--------------------------------------------------------------------------
    */
    'library_pathes' => [
        'pngquant' => env('LIBRARY_PNGQUANT_BINARY_PATH', '/usr/local/bin/pngquant'),
        'jpegtran' => env('LIBRARY_JPEGTRAN_BINARY_PATH', '/usr/local/bin/jpegtran'),
        'imagemagick' => env('LIBRARY_IMAGEMAGICK_BINARY_PATH', '/usr/local/bin/convert'),
    ],

    /*
    |--------------------------------------------------------------------------
    | Путь к директории хранения файлов
    |--------------------------------------------------------------------------
    */
    'resources_public_path' => 'assets/server/images/',

    /*
    |--------------------------------------------------------------------------
    | Очередь для работы с файлами
    |--------------------------------------------------------------------------
    */
    'resources_queue' => env('BACKEND_SDK_RESOURCES_QUEUE', 'default'),

];